#### Terraform Format and Style 🖌`success`
### Workspace

`undefined`

#### Terraform Initialization ⚙️`success`
#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```hcl
terraform
github_membership.user_membership["TranNgocNam2"]: Refreshing state... [id=fptudsc:TranNgocNam2]
github_membership.user_membership["YP2743"]: Refreshing state... [id=fptudsc:YP2743]
github_membership.user_membership["dawngn"]: Refreshing state... [id=fptudsc:dawngn]
github_membership.user_membership["baolongv3"]: Refreshing state... [id=fptudsc:baolongv3]
github_membership.user_membership["kaitoz11"]: Refreshing state... [id=fptudsc:kaitoz11]
github_team.teams["devops"]: Refreshing state... [id=7937042]
github_team.teams["frontend"]: Refreshing state... [id=7937043]
github_team.teams["backend"]: Refreshing state... [id=7937041]
github_team_members.some_team_members["backend"]: Refreshing state... [id=7937041]
github_team_members.some_team_members["frontend"]: Refreshing state... [id=7937043]
github_team_members.some_team_members["devops"]: Refreshing state... [id=7937042]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # github_membership.admin_membership["baolongv3"] will be created
  + resource "github_membership" "admin_membership" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "admin"
      + username = "baolongv3"
    }

  # github_team.teams["backend"] will be updated in-place
  ~ resource "github_team" "teams" {
      ~ description               = "Group consist of member in DevOps branchess" -> "Group consist of member in DevOps branches"
        id                        = "7937041"
        name                      = "backend"
        # (6 unchanged attributes hidden)
    }

  # github_team.teams["branch_leader"] will be created
  + resource "github_team" "teams" {
      + create_default_maintainer = false
      + description               = "Group consist of all leader in all branches"
      + etag                      = (known after apply)
      + id                        = (known after apply)
      + members_count             = (known after apply)
      + name                      = "branch_leader"
      + node_id                   = (known after apply)
      + privacy                   = "closed"
      + slug                      = (known after apply)
    }

  # github_team_members.some_team_members["branch_leader"] will be created
  + resource "github_team_members" "some_team_members" {
      + etag    = (known after apply)
      + id      = (known after apply)
      + team_id = (known after apply)

      + members {
          + role     = "member"
          + username = "baolongv3"
        }
    }

  # github_team_members.some_team_members["devops"] will be updated in-place
  ~ resource "github_team_members" "some_team_members" {
        id      = "7937042"
        # (2 unchanged attributes hidden)

      - members {
          - role     = "member" -> null
          - username = "baolongv3" -> null
        }

        # (4 unchanged blocks hidden)
    }

Plan: 3 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

**Pusher**: @baolongkms
**Action**: pull_request
